In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as mp
import seaborn as sn

In [5]:
dataset=pd.read_csv("lab6_Employeedataset.csv")
print(dataset)

       avg_monthly_hrs   department  filed_complaint  last_evaluation  \
0                  221  engineering              NaN         0.932868
1                  232      support              NaN              NaN
2                  184        sales              NaN         0.788830
3                  206        sales              NaN         0.575688
4                  249        sales              NaN         0.845217
...                ...          ...              ...              ...
14244              178           IT              NaN         0.735865
14245              257        sales              NaN         0.638604
14246              232      finance              1.0         0.847623
14247              130           IT              NaN         0.757184
14248              159          NaN              NaN         0.578742

       n_projects  recently_promoted  salary  satisfaction    status  tenure
0               4                NaN     low      0.829896      Left     5.0
1               3                NaN     low      0.834544  Employed     2.0
2               3                NaN  medium      0.834988  Employed     3.0
3               4                NaN     low      0.424764  Employed     2.0
4               3                NaN     low      0.779043  Employed     3.0
...           ...                ...     ...           ...       ...     ...
14244           5                NaN     low      0.263282  Employed     5.0
14245           3                NaN     low      0.868209  Employed     2.0
14246           5                NaN  medium      0.898917      Left     5.0
14247           4                NaN  medium      0.641304  Employed     3.0
14248           3                NaN  medium      0.808850  Employed     3.0

[14249 rows x 10 columns]

In [26]:
col_Name=dataset.columns
print(col_Name)
print(len(col_Name))
for x in col_Name:
    print(type(x))

Index(['avg_monthly_hrs', 'department', 'filed_complaint', 'last_evaluation',
       'n_projects', 'recently_promoted', 'salary', 'satisfaction', 'status',
       'tenure'],
      dtype='object')
10
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [28]:
dataset.size
r=dataset.shape[0]
print(f"the no of rows are :{r}")
c=dataset.shape[1]
print(f"the no of cols are :{c}")

the no of rows are :14249
the no of cols are :10

In [36]:
#Explortary data analysis EDA

dataset.isnull() # table formate with true or false
dataset.isnull().any()
dataset.isnull().sum() #count of each column which contains the null values

avg_monthly_hrs          0
department             709
filed_complaint      12191
last_evaluation       1532
n_projects               0
recently_promoted    13949
salary                   0
satisfaction           181
status                   0
tenure                 181
dtype: int64

In [38]:
dataset.head(7)

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure
0,221,engineering,NaN,0.932868,4,NaN,low,0.829896,Left,5.0
1,232,support,NaN,NaN,3,NaN,low,0.834544,Employed,2.0
2,184,sales,NaN,0.788830,3,NaN,medium,0.834988,Employed,3.0
3,206,sales,NaN,0.575688,4,NaN,low,0.424764,Employed,2.0
4,249,sales,NaN,0.845217,3,NaN,low,0.779043,Employed,3.0
5,140,sales,NaN,0.589097,4,NaN,medium,0.660020,Employed,4.0
6,121,sales,1.0,0.625399,3,NaN,low,0.835571,Employed,3.0

In [40]:
dataset.tail(3)

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure
14246,232,finance,1.0,0.847623,5,NaN,medium,0.898917,Left,5.0
14247,130,IT,NaN,0.757184,4,NaN,medium,0.641304,Employed,3.0
14248,159,NaN,NaN,0.578742,3,NaN,medium,0.808850,Employed,3.0

In [42]:
dataset.sample(6)

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure
11626,187,admin,NaN,NaN,4,NaN,low,0.634592,Employed,2.0
6307,164,engineering,NaN,0.593141,3,NaN,medium,0.520962,Employed,3.0
13359,230,sales,NaN,0.526165,2,NaN,medium,0.588986,Employed,4.0
11728,147,sales,NaN,0.516729,4,NaN,low,0.633097,Employed,10.0
2783,149,support,NaN,NaN,3,NaN,low,0.859971,Employed,3.0
11215,242,support,NaN,0.798461,4,NaN,medium,0.556810,Employed,2.0

### Data Imputation
Data imputation is a technique used to handle missing data in a dataset.
When you encounter missing values (NaN), instead of removing the rows or columns with missing values,
you can replace them with substituted values.
This helps maintain the size of the dataset and ensures that valuable information isn't lost.

In [63]:
#handling the null values for different columns
print(f"before ,{dataset['tenure']}")
null_count=dataset['tenure'].isnull().sum() #181
mean=dataset['tenure'].mean()
print("the dataste",mean)
dataset['tenure']=dataset['tenure'].fillna(mean)
print(f"the after{dataset['tenure']}")
#similarly

dataset['last_evaluation'] = dataset['last_evaluation'].fillna((dataset['last_evaluation'].mean()))
dataset['satisfaction'] = dataset['satisfaction'].fillna((dataset['satisfaction'].mean()))
dataset['department'] = dataset['department'].fillna((dataset['department'].mode()))

before ,0        5.0
1        2.0
2        3.0
3        2.0
4        3.0
        ...
14244    5.0
14245    2.0
14246    5.0
14247    3.0
14248    3.0
Name: tenure, Length: 14249, dtype: float64
the dataste 3.497227750924083
the after0        5.0
1        2.0
2        3.0
3        2.0
4        3.0
        ...
14244    5.0
14245    2.0
14246    5.0
14247    3.0
14248    3.0
Name: tenure, Length: 14249, dtype: float64

In [65]:
dataset.isnull().sum()

avg_monthly_hrs          0
department             709
filed_complaint      12191
last_evaluation          0
n_projects               0
recently_promoted    13949
salary                   0
satisfaction             0
status                   0
tenure                   0
dtype: int64

In [69]:
#let replace the rest with 0
dataset=dataset.fillna(0)
dataset.isnull().sum()

avg_monthly_hrs      0
department           0
filed_complaint      0
last_evaluation      0
n_projects           0
recently_promoted    0
salary               0
satisfaction         0
status               0
tenure               0
dtype: int64

In [79]:
c=dataset.dtypes
print("clolumn datatypes",c)
col_name=dataset.columns
for x in col_name:
    print(type(x))

clolumn datatypes avg_monthly_hrs        int64
department            object
filed_complaint      float64
last_evaluation      float64
n_projects             int64
recently_promoted    float64
salary                object
satisfaction         float64
status                object
tenure               float64
dtype: object
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [83]:
dataset['tenure'].dtype
dataset.sample(10)

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure
10842,240,sales,0.0,0.932006,3,0.0,medium,0.505195,Employed,2.0
13878,299,marketing,0.0,0.862751,6,0.0,low,0.098636,Left,4.0
9085,145,engineering,0.0,0.894826,4,0.0,medium,0.890501,Employed,3.0
1034,205,engineering,0.0,0.777976,3,0.0,medium,1.000000,Employed,2.0
6418,196,support,0.0,0.642372,4,0.0,medium,0.883223,Employed,3.0
11221,167,IT,0.0,0.546832,4,0.0,medium,0.790556,Employed,3.0
13722,155,sales,0.0,0.472712,2,0.0,medium,0.417506,Left,3.0
3482,227,IT,0.0,0.851172,3,0.0,low,1.000000,Employed,3.0
1323,243,engineering,0.0,0.509908,4,0.0,low,0.692911,Employed,2.0
5268,196,0,0.0,0.749796,3,0.0,medium,0.890864,Employed,3.0

In [ ]:
#visualizations :)